Repository: giellalt/corpus-sme
Catalog: prestable/tmx/nob/facta/skuvlahistorja5/reisavgs-s.htm.tmx
Source language: sme
Languages: nob

source: På norsk
nob: Sámegillii

source: Artihkal girjjis Sámi skuvlahistorjá 5 .
nob: Artikkel i boka Samisk skolehistorie 5 .

source: Ráissa joatkkaskuvlla sámegieloahpahus
nob: Samisk ved Nordreisa videregående skole

source: Siri Broch Johansen , Guovdageaidnu 2006 ( Govva : Svein Lund )
nob: Siri Broch Johansen , Guovdageaidnu 2006 ( Foto : Svein Lund )

source: Siri Broch Johansen lea Sámi skuvlahistorjjá mieldoaimmaheaddjin ja su birra logat eambbo Sámi skuvlahistorjá 2:s .
nob: Siri Broch Johansen er medredaktør i Samisk skolehistorie og er nærmere presentert i Samisk skolehistorie 2 .

source: Dán artihkkala vuođđu lea jearahallan Ruth Larseniin . Ruth Larsen lea Ráissajoatkkaskuvlla sámegieloahpaheaddji ja ossodatjođiheaddji .
nob: Denne artikkelen er i stor grad basert på intervju med Ruth Larsen , som er samisklærer og avdelingsleder ved Nordreisa videregående skole .

source: Son riegádii Skárfvákkis Gáivuonas 1949:s .
nob: Ruth Larsen er født i Skardalen i Kåfjord i 1949 .

source: Sus lea dearvvašvuođa- ja birasfágaid fágaoahpaheaddjioahppu Finnmárkku allaskuvllas .
nob: Hun er utdannet faglærer i helse- og miljøfag fra Høgskolen i Finnmark .

source: Maŋŋil lea váldán liigeoahpu , son lea erenoamášpedagogan ja logai sámegiela Sámi allaskuvllas , lávdaoahpus Gáivuonas 1999:s .
nob: Senere har hun tatt videreutdanning i spesialpedagogikk . Hun tok samisk grunnfag ved Samisk høgskole , desentralisert i Kåfjord i 1999 .

source: Son lea bargan Ráissa joatkkaskuvllas 1982 rájes .
nob: Ruth Larsen har arbeidet ved Nordreisa videregående skole siden 1982 .

source: Jearahallan dahkkui skuvlajagi 2010/11 .
nob: Intervjuet er gjort skoleåret 2010/11 .

source: Ruth Larsen ( Gova luoikan Ruth Larsen )
nob: Ruth Larsen ( Foto utlånt av Ruth Larsen )

source: Ráissa joatkkaskuvla šaddá duohtan
nob: Nordreisa videregående skole blir til

source: 1964 rádjái eai lean Davvi-Romssas oahppofálaldagat eambbo go álbmotskuvla .
nob: Fram til 1964 var det ingen utdanningstilbud utover folkeskolen i Nord-Troms .

source: 1964:s bođii Ráisii dálueamitskuvla .
nob: I 1964 fikk Nordreisa husmorskole .

source: Realskuvla bođii 1965:s , ja jagi maŋŋá ges mekánalaš fágaid fálaldat .
nob: Realskole kom i 1965 , og året etter et tilbud i mekaniske fag .

source: 1971:s ásahuvvui Ráisii gymnásaluohkká ja gávpeskuvla .
nob: I 1971 ble det oppretta gymnasklasse og handelsskole i Nordreisa .

source: Buot skuvlafálaldagat ledje Romssa gávpoga skuvllaid ossodahkan , ja oahpahus lei láigolanjain .
nob: Alle skoletilbudene var filialer under Tromsø-skolene , og undervisninga foregikk i leide lokaler .

source: De viimmat , 1975:s rahppui Ráissa joatkkaskuvlla ollislaš joatkkaskuvlan mii fálai sihke fidnofágaid ja dábálašfágaid .
nob: I 1975 ble Nordreisa videregående skole endelig åpnet som en fullverdig videregående skole med både yrkesfag og allmennfag .

source: Ráissa joatkkaskuvlla ávvudančálus
nob: Nordreisa videregående skoles jubileumsskrift

source: Sámegieloahpahus álgá
nob: Oppstart av samiskundervisninga

source: Ráissa joatkkaskuvlla višuvdna lea álo leamaš , ja lea ain , váldit vára guovllu kultuvrras , historjjás ja gielas .
nob: Visjonen for Nordreisa videregående skole har alltid vært og er fremdeles å ta vare på regionens kultur , historie og språk .

source: Skuvla fálai suomagiela fágan 1977 rájes juo , muhto sámegieloahpahusa álggii easkka 1988:s .
nob: Skolen tilbød finsk som fag allerede fra 1977 , men samiskundervisninga starta opp først i 1988 .

source: Vuosttaš sámegieloahpaheaddji lei Ivar Vangen , gii lei Olmmáivákkis eret .
nob: Den første samisklæreren var Ivar Vangen , opprinnelig fra Manndalen .

source: Son barggai skuvllas gitta dassážii go manai ealáhahkii 1998:s .
nob: Han jobba ved skolen til han gikk av med pensjon i 1998 .

source: Ivvára eatnigiella lei sámegiella , ja son váccii Romssa oahpaheaddjiskuvlla mas čiekŋudii earret iežá sámegillii .
nob: Ivar hadde samisk som morsmål , og hadde lærerutdanning fra Tromsø med fordypning i blant annet samisk .

source: Dakka maŋŋelaš biddjui maid Harald Lindbach virgái religiuvdna- ja sámegieloahpaheaddjin .
nob: Kort tid etter blei Harald Lindbach tilsatt som religions- og samisklærer .

source: Álggus ledje skuvllas okta dahje guokte sámegieljoavkku man oahppit lohke sámegiela vierisgiellan .
nob: Den første tida hadde skolen en til to grupper med elever som tok samisk som fremmedspråk .

source: Skuvla maid lágidii eahketgurssaid rávesolbmuid várás .
nob: Skolen arrangerte også kveldskurs for voksne .

source: Sihke skuvlla bargit ja giliolbmot vázze gurssaid .
nob: Både skolens ansatte og folk fra bygda deltok .

source: Go Ráissa joatkkaskuvla oaččui čuoiganlinjjá 1984:s , de bohte eanet oahppit Finnmárkkus .
nob: Da Nordreisa videregående skole fikk skilinje i 1984 , kom det flere elever fra Finnmark .

source: Ledje erenoamáš olusat Guovdageainnus , muhto maid Deanus .
nob: Det var spesielt mange fra Kautokeino , men også fra Tana .

source: Vuosttamuš gii válddii eksámena sámegielas nubbingiellan , lei Signe Trosten gii leai čuoiganlinjjá oahppi .
nob: Den første som tok eksamen i samisk som andrespråk var Signe Trosten som var elev på skilinja .

source: Jagi maŋŋá , 1991:s , válddii Ann Mary Nilsen eksámena sámegielas nubbingiellan JK 1 gávpe- ja kanturfágalinjjás , ja Berit Kristin Hætta válddii vuosttašgiellaeksámena dábálašfágalinjjás .
nob: Året etter , i 1991 , tok Ann Mary Nilsen eksamen i samisk som andrespråk på VKI Handels- og kontorfag og Berit Kristin Hætta tok eksamen i samisk som førstespråk på allmennfag .

source: Iešnannejeaddji sámegielfálaldat
nob: Selvforsterkende samisktilbud

source: Go sámegielfálaldat ásahuvvui , de šattai sámegiella eambbo oidnosis skuvllas , šattai dábálažžan gullat sámegiela bargiidlanjas , feaskáriin ja kantiinnas .
nob: Med opprettelsen av samisktilbud ble samisk mer synlig på skolen , det ble vanlig å høre samisk på personalrommet , i korridorene og i kantina .

source: Sámegielfága stuorui , šattai sierra sámegielsekšuvdna skuvllas .
nob: Samiskfaget vokste og skolen fikk en egen samiskseksjon .

source: Dál leat Ráissa joatkkaskuvllas 6 oahpaheaddji geat oahpahit sámegiela .
nob: Nå har Nordreisa videregående skole seks lærere som underviser i samisk .

source: Gaikkain lea alit oahppu sámegielas , ja viđas sis lea pedagogalaš oahppu .
nob: Alle har høyere utdanning i samisk , og fem av dem har pedagogisk utdanning .

source: Guovtti skuvlla dálá oahpaheaddji leaba ovdal leamaš sámegieloahppin dáppe . Guktot logaiga dalle sámegiela vierisgiellan .
nob: To av skolens nåværende lærere har vært samiskelever ved skolen tidligere , og begge tok da samisk som fremmedspråk .

source: Ruth Larsena mielas dát vuoseha ahte lea vejolaš lohkagoahtit sámegiela easkka joatkkaskuvllas , ja liikká beassat nu alla dássái ahte ieš sáhttá oahpahit sámegiela .
nob: Ruth Larsen mener dette viser at det er mulig å starte med samisk så seint som på videregående skole og jobbe seg opp på et nivå hvor man kan undervise i samisk .

source: Ráissa joatkkaskuvllas leat álo máŋgga oahppi háliidan sámegiela vierisgiellan .
nob: Nordreisa videregående skole har bestandig hatt mange elever som vil ha samisk som fremmedspråk .

source: Vel odne ge bohtet áibbas umáhttu oahppit joatkkaskuvllaide , danin go vuođđoskuvllaid oahpaheaddjiváili hehtte sin lohkamis sámegiela vuođđoskuvllas .
nob: Ennå i dag kommer elever med blanke ark til videregående skole fordi lærermangel i grunnskolene har gjort at de ikke har fått samiskopplæring der .

source: Ráissa joatkkaskuvllas
nob: Fra Nordreisa videregående skole

source: ( Gova luoikan Ruth Larsen )
nob: ( Foto utlånt av Ruth Larsen )

source: Oahppogirji ja sámegielfoanttat
nob: Lærebok og samisk tegnsett

source: Maŋŋá go sámelága giellanjuolggadusat bohte fápmui 1993:s ja Gáivuona sámi giellaguovddáš ásahuvvui 1994:s , de šattai sámegiella ain eambbo oidnosis .
nob: Etter at språkreglene i sameloven trådte i kraft i 1993 og Samisk språksenter i Kåfjord ble opprettet i 1994 , ble samisk enda mer synlig .

source: Ain eanet oahppit sihte váldit ruoktot giela mii lei leamaš nu dábálaš eanaš Davvi-Romssa giliin .
nob: Et økende antall elever ønsket å ta tilbake språket som hadde vært vanlig i de fleste bygdene i Nord-Troms .

source: Skuvla galbejuvvui sámegillii , ja maŋŋil oaččui skuvlla ođđa nama , Nordreisa videregående skole – Ráissa joatkkaskuvla .
nob: Skolen ble skiltet på samisk og senere fikk skolen nytt offisielt navn , Nordreisa videregående skole – Ráissa joatkkaskuvla .

source: 1994:s álggii Leif-Petter Eriksen skuvlii oahpaheaddjin .
nob: I 1994 begynte Leif-Petter Eriksen som lærer ved skolen .

source: Ráissa joatkkaskuvla lei dalle dihtorastimis ovdamanniskuvla .
nob: Nordreisa videregående var den gangen pilotskole i databruk .

source: Eriksen fuobmái viehka fargga ahte skuvla dárbbašii sámegielfoanttaid dihtoris jus galggai sáhttit PC:id atnit sámegieloahpahusas .
nob: Eriksen innså raskt at skolen måtte ha samisk tegnsett for å kunne benytte PC-er i samiskundervisninga .

source: Son oaččui guokte dihtorčeahppi mielde , ja ovttas de ráhkadedje sámi foanttaid maid skuvla de anii máŋga jagi .
nob: Han fikk to datakyndige med seg , og sammen lagde de et samisk tegnsett som skolen brukte i mange år .

source: 1995:s ilmmai Harald Lindbacha oahppogirji Gáttiin ja meara nalde .
nob: I 1995 utga Harald Lindbach læreboka Gáttiin ja meara nalde .

source: Skuvlla fidnii ruđaid olggobealde vai Lindbach beasai dušše girjjiin bargat .
nob: Skolen fikk midler utenfra så Lindbach kunne kjøpes fri til å jobbe med boka .

source: Váilui oahppogirji mas oasit ledje mearrasámi guovlluin .
nob: Det var behov for ei lærebok hvor noe av stoffet var henta fra sjøsamiske områder .

source: Girji lei jurddašuvvon joatkkaoahpu oahppogirjin .
nob: Boka var tenkt som lærebok i videregående opplæring .

source: Lea adnon oahppogirjin ja veahkkegirjin min ohppiide , erenoamážit nubbingielohppiide , muitala Ruth Larsen .
nob: Den er blitt brukt som lærebok og hjelpebok for våre elever , spesielt for elever med samisk som andrespråk , forteller Ruth Larsen .

source: Girjjis Lindbach atná buori muddui Davvi-Romssa suopmana .
nob: Lindbach bruker et godt stykke på vei Nord-Troms-dialekta i boka .

source: Girji lei vuosttaš davvisámegiel oahppogirji mas eai lean dušše siseatnansuopmanat .
nob: Dette var den første læreboka som kom ut på nordsamisk som ikke bare brukte innlandsdialekter .

source: Dát dagahii álkibun ohppiide dovdat iežaset duogáža girjjis , ja dát fas movttiidahtii sin oahppat eanet .
nob: Dette gjorde det lettere for elevene å kjenne seg igjen , og det igjen økte læringsmotivasjonen .

source: Maid okta áidna oahpaheaddjeoahppofálaldat sáhttá mearkkašit olles regiovdnii
nob: Hva ett eneste lærerutdanningstilbud kan bety for en region

source: 1997:s ražai skuvlla sámegieloahpaheddjiid fidnemis , ja ohppiidlohku lei maid unnon .
nob: I 1997 slet skolen med få samisklærere , og det var også en nedgang i elevtallet .

source: Danin bázii sámegiella vierisgielfálaldaga fálatkeahttá ovtta jagi , ja ohppiidlohku sámegielfágas njiejai sakka .
nob: Derfor ble tilbudet om samisk som fremmedspråk tatt bort for et år , og tallet på elever med samisk i fagkretsen sank betraktelig .

source: Earret iežá Gáivuona suohkan dieđihii ahte ii liikon dása .
nob: Blant annet Kåfjord kommune reagerte negativt på dette .

source: Danin álggahuvvui sámegiella vierisgielfálaldaga fas jagi maŋŋá juo , ja das rájes lea álo leamaš dakkár fálaldat skuvllas .
nob: Tilbudet om samisk som fremmedspråk kom derfor igjen allerede fra høsten etter , og har vært der hele tida siden .

source: Harald Johannessen lei lohkaninspektevran 1986 rájes 1994 rádjái .
nob: Harald Johannessen var studieinspektør fra 1986 til 1994 .

source: Son áŋgirušai skuvlla sámegielfálaldaga beales .
nob: Han var en ivrig forkjemper for at skolen skulle tilby samisk som språkfag .

source: Dalle , nu mo dál ge , váilo sámegieloahpaheaddjit .
nob: Den gang som nå var det mangel på samisklærere .

source: Son vikkai hálahit Ruth Larsena lohkat sámegiela , go juo bođii mearrasámi gilis , Skárfvákkis , ja go máhtii juo sámegiela beallemuddui .
nob: Han prøvde å overtale Ruth Larsen til å studere samisk , siden hun kom fra ei sjøsamisk bygd , Skardalen , og kunne en del samisk fra før .

source: Ruth Larsen ozai sámegiel lohkanbadjeoahpu mii álggii Olmmáivákkis Gáivuonas 1997 ’ čavčča .
nob: Ruth Larsen søkte på Samisk semesteremne som startet i Manndalen i Kåfjord høsten 1997 .

source: Lohkanfálaldat lei Gáivuona sámi giellaguovddáža ja Sámi allaskuvlla ovttasbargoprošeaktan .
nob: Studiet var et samarbeidsprosjekt mellom Samisk språksenter i Kåfjord og Samisk høgskole .

source: Ruth Larsen jotkkii lávdaduvvon oahpus 1998:s , dát lei maid Olmmáivákkis , ja 1999 ’ giđa válddii son vuođđofágaeksámena .
nob: Ruth Larsen fortsatte med det desentraliserte studiet i 1998 , også det i Manndalen , og tok grunnfagseksamen i nordsamisk våren 1999 .

source: Dát lohkanfálaldat mielddisbuvttii ahte máŋga davviromsalačča besse formaliseret máhtuset , sii ohppe giellaoahpa , čállingiela ja oahpásmuvve sámi girjjálašvuođain .
nob: Dette studietilbudet medførte at mange fra Nord-Troms har fått formalisert sine kunnskaper , lært grammatikk , skriftspråk og blitt kjent med samisk litteratur .

source: Dát maid dagahii ahte sii šadde eanet dihtomielalaččat sámi identitehtaset ja historjjáset ektui .
nob: Dette gjorde også at de ble mer bevisst sin samiske identitet og historie .

source: Leif-Petter Eriksen ja Idar Pedersen geat dál leaba Ráissa joatkkaskuvlla oahpaheaddjit , válddiiga sámegiela vuođđofága dán lávdaduvvon oahpu bokte .
nob: Leif Petter Eriksen og Idar Pedersen som i dag er samisklærere ved Nordreisa videregående skole tok samisk grunnfag gjennom dette desentraliserte tilbudet .

source: Elisabeth Johansen válddii Sámegiela lohkanbadjeoahpu ja Sámegiella I Gáivuonas ovdal go álggii Sámi allaskuvlii . Doppe válddii son vuođđofága dábálašoahpaheaddjeoahpu oassin .
nob: Elisabeth Johansen tok Samisk semesteremne og Samisk I i Kåfjord før hun begynte på Samisk høgskole hvor hun fullførte grunnfaget som en del av allmennlærerutdannelsen sin .

source: Sihke Ráissa joatkkaskuvla ja iežát regiovnnas leat háliidan sullasaš fálaldaga Davvi-Romsii fas , muhto Sámi allaskuvla ii leat dán rádjái fállan maidege [ 1 ]
nob: Både Nordreisa videregående og andre i regionen har ønsket å få et lignende tilbud til Nord-Troms igjen , men Samisk høgskole har hittil ikke imøtekommet ønsket . [ 1 ]

source: Bearašolbmuide lea váttis johtit Guovdageidnui oahpu gazzat .
nob: For familiefolk er det vanskelig å reise til Kautokeino for å ta utdanning .

source: Soaitá dovdat iežas eambbo oadjebassan ruovttoguovllustis .
nob: Man kan føle seg « tryggere » i hjemlige omgivelser .

source: Ruth Larsen dadjá iežas dovdat dušše guokte studeantta Davvi-Romssas geat leaba fárren Guovdageidnui viidásut lohkat allaskuvllas .
nob: Ruth Larsen sier hun bare kjenner til to studenter fra Nord-Troms som har flytta til Kautokeino for å studere videre .

source: Goappašagat geat leaba dan bargan , bargaba dál oahpaheaddjin Ráissa joatkkaskuvllas .
nob: Begge disse er i dag lærere ved Nordreisa videregående skole .

source: 1999:s válddii Mikkel Bongo [ 2 ] badjelasas rektorin .
nob: I 1999 overtok Mikkel Bongo [ 2 ] som rektor .

source: Seamma áigge gerge studeremis máŋggas sis geat dál leat sámegieloahpaheaddjit vuođđofágagelbbolašvuođain , ja fáhkka lei oahpaheaddjeváili čovdojuvvon , goit dán boddui .
nob: Samtidig avsluttet mange av de lærerne som er her i dag grunnfagstudiet i samisk , og plutselig var lærerproblemet over for en stund .

source: Dalle sáhtiimet ođđa guvlui smiehttat , ja de bohciidii jurdda ovdánahttit Ráissa joatkkaskuvlla gáiddusoahpahusskuvlan , muitala Ruth Larsen .
nob: Da kunne vi tenke nytt og tanken på å utvikle Nordreisa videregående til fjernundervisningsskole oppsto , forteller Ruth Larsen .

source: Gáiddusoahpahus
nob: Fjernundervisning

source: 1999 čavčča álggahii Romssa fylkkasuohkan prošeavtta « Gáiddusoahpahus » .
nob: Høsten 1999 startet Troms fylkeskommune prosjektet « Fjernundervisning » .

source: 2000 guovvamánu ledje njeallje oahpaheaddji Árranis Divttasvuonas oahppamin guovtteguvllot jietna- / govva-gáiddusoahpahusa birra .
nob: I februar 2000 var fire lærere på kurs på Árran i Tysfjord for å lære om toveis lyd / bilde-fjernundervisning .

source: Fylkkasuohkan juolludii ruđa studiooastimii , ja 2000 čavčča álggahii Ráissa joatkkaskuvla gáiddusoahpahusa .
nob: Fylkeskommunen bevilget midler til innkjøp av studio , og høsten 2000 var Nordreisa i gang med fjernundervisning .

source: Vuosttaš gáiddusoahpahusjagi , 2000–2001 , vuostáiválde earret iežá Bardufoss , Tromsdalen , Kvaløya ja Nordkjosbotn 3 joatkkaskuvllat oahpahusa .
nob: Det første året fjernundervisningen var i drift , 2000–2001 , var bl.a. Bardufoss , Tromsdalen , Kvaløya og Nordkjosbotn videregående skoler mottakere .

source: Gáiddusoahpahus šattai bivnnut , ja Ráissa joatkkaskuvla fertii de ovtta vel studio háhkat ja virgái bidjat eanet oahpaheddjiid .
nob: Etterspørselen økte , og Nordreisa videregående måtte skaffe seg et studio til og ansette flere lærere .

source: Dál leat skuvllas golbma studio .
nob: Nå har skolen tre studioer .

source: Okta lea várrejuvvon iešguđetge fágaid rávesolbmuidoahpahussii .
nob: Ett er spesielt beregnet for voksenopplæring i forskjellige fag .

source: Dat guokte iežá studio geavahuvvojit duššefal sámegiel gáiddusoahpahussii .
nob: De to andre brukes bare til fjernundervisning i samisk .

source: Vuostáiváldi oahppi- ja skuvlalohku lea rievdadan jagis jahkái .
nob: Elevtallet og antall skoler som tar imot fjernundervisning har variert fra år til år .

source: Leat leamaš gitta 12 vuostáiváldi skuvlla , muhto dál leat dássidit 8–10 skuvlla mat váldet vuostá gáiddusoahpahusa .
nob: På det meste har det vært opptil 12 skoler , men nå har det stabilisert seg på 8 – 10 skoler .

source: Eanaš skuvllat leat joatkkaskuvllat Romssa fylkkas mat váilot sámegieloahpaheaddjit .
nob: De fleste skolene er videregående skoler i Troms som mangler samisklærer .

source: Ráissa joatkkaskuvla fállá gáiddusoahpahusa skuvllaide olggobeale fylkka maid , go lea kapasiteahta .
nob: Nordreisa videregående skole gir også undervisning til skoler utenfor fylket når det er ledig kapasitet .

source: Dán jagi oahpaha skuvla ohppiid Budejjus ja Troandimis .
nob: I år underviser skolen elever i Bodø og Trondheim .

source: Tromssa fylkka skuvllat atnet dihtorvuogádaga Class Fronter , ja dán láhkái sáhttet oahpaheaddjit álkit gulahallat njuolgga ovttaskas ohppiin .
nob: I Troms bruker de videregående skolene læreplattformen Class Fronter , dermed kan lærerne enkelt kommunisere direkte med hver enkelt elev .

source: Skuvla geahččala gáiddusoahpahusohppiiguin deaivvadit oktii jagis .
nob: Skolen prøver å møte fjernundervisningselevene en gang i året .

source: Sii bovdejuvvojit oahppomátkkiide .
nob: Da blir de invitert med på ekskursjoner .

source: Mannan dálvvi mátkkoštii joavku Kárášjohkii ja Guovdageidnui .
nob: Sist vinter var det en tur til Karasjok og Kautokeino .

source: Doppe gallededje Sámedikki ja Sámi allaskuvlla .
nob: Der besøkte skolen Sametinget og Samisk høgskole .

source: Ovdal leat leamaš oahppomátkkit earret iežá Johkamohkemárkaniidda .
nob: Tidligere har det vært turer bl.a. til Jokkmokkmarkedet .

source: Máŋga gáiddusoahpahusoahppi leat maid galledan Ráissa joatkkaskuvlla sámi álbmotbeaivvi ávvudeami oktavuođas .
nob: Mange fjernundervisningselever har også vært på besøk på skolen i Nordreisa i forbindelse med feiring av samefolkets dag .

source: Gáiddusoahpahus lea leamaš gelddolaš ja lea addán olu Ráissa joatkkaskuvlii , dadjá Ruth Larsen .
nob: Fjernundervisningen har vært spennende og givende for Nordreisa videregående skole , sier Ruth Larsen .

source: Skuvla lea fidnen oktavuođa ja oahpásmuvvan máŋga iežá skuvllain , ohppiin , oahpaheddjiin ja jođiheddjiin .
nob: Vi har blitt kjent med mange nye skoler og deres elever , lærere og ledelse .

source: Gáiddusoahpahus lea dagahan ahte skuvla lea sáhttán doalahit sámegielsekšuvnna , skuvllas leat leamaš seammá sámegieloahpaheaddjit moanaid jagiid .
nob: Fjernundervisningen har gjort at skolen har kunnet beholde samiskseksjonen , det vil si at lærerstaben i samisk har vært stabil over flere år .

source: Gáiddusoahpahusa iežá joatkkaskuvllaide lassin , de lea Ráissa joatkkaskuvla maid vuovdán oahpahusa iešguđet vuođđoskuvllaide Ráissa suohkanis , ja de vel ovtta skuvlii Hallingdalas .
nob: I tillegg til fjernundervisning for andre videregående skoler har Nordreisa videregående også hatt noen timer undervisning til ulike grunnskoler i Nordreisa kommune og til en skole i Hallingdal .

source: Soames skuvllaide mat leat hui lahka , vuodjá oahpaheaddji , muhto muđui lea gáiddusoahpahus .
nob: Noen av de nærmeste skolene kjører læreren til , men ellers er det fjernundervisning som gjelder .

source: Ráissa joatkkaskuvllas leat leamaš máŋga sámegieloahppi juohke jagi , leat leamaš gitta 90 oahppi muhtun jagiid .
nob: Nordreisa har hatt mange elever i samisk hvert år , opp til 90 elever på det meste .

source: Oahppit leat bures birgen fágalaččat .
nob: Elevene har hatt gode faglige resultater .

source: Romssa fylkka resursaskuvla
nob: Ressursskole for Troms

source: Ráissa joatkkaskuvla lea Romssa fylkka sámi resursaskuvlan .
nob: Nordreisa videregående skole er samisk ressursskole i Troms fylke .

source: Skuvla lea ovttasbargan iežá fylkka joatkkaskuvllaiguin mas leat sámegieloahpaheaddjit , earret iežá oahpahanvugiid , áigeguovdilis oahppogirjjiid- ja girjjálašvuođabagadallamiin ja iešguđetge oahpponeavvuid geavaheames .
nob: Skolen har hatt samarbeid med de andre videregående skolene i fylket som har egen samisklærer , og har blant annet veiledet i undervisningsmetoder , aktuelle lærebøker og litteratur samt bruk av ulike læremidler .

source: Skuvla lea maid lágidan sámi seminára ja gurssaid Davvi-Romssa vuođđoskuvllaid oahpaheddjiide .
nob: Skolen har også arrangert samisk seminar og kurs for lærere i grunnskolene i Nord-Troms .

source: Gáivuona sámi giellaguovddáš lea leamaš buorre ovttasbargoguoibmi .
nob: Samisk språksenter i Kåfjord har vært en fin samarbeidspartner .

source: Skuvlla sámegieloahpaheaddjit leat vázzán metodagurssa giellaguovddážis , ja leat dan maŋŋá atnán giellaguovddáža oahpponeavvuid , erenoamážit giellaguovddáža speallan-oahpponeavvuid mat leat fáhtemis interneahtas .
nob: Skolen har deltatt på metodekurs ved språksenteret , og har seinere brukt læremidler som er utviklet der , spesielt språksenterets spillemateriell som er lagt ut for nedlasting på internett .

source: Máhttolokten
nob: Kunnskapsløftet

source: 2006/07 ’ skuvlajagi álggahuvvui Máhttoloktema doibmiibidjan sihke vuođđoskuvllas ja joatkkaskuvllas .
nob: Skoleåret 2006/07 begynte innføringa av Kunnskapsløftet i både grunnskole og videregående skole .

source: Dalle rievdaduvvui maid joatkkaskuvllaid sámegielfálaldat
nob: Da ble samtidig fagtilbudet i samisk på videregående nivå endra .

source: Ođastus 94 rájes lei skuvllas čuovvovaš fálaldat : - sámegiella vuosttašgiellan - sámegiella nubbingiellan - sámegiella vierisgiellan ( B-giellan sin várás geat leat vuođđoskuvllas lohkan fága , C-giella sin várás geat eai leat ovdal lohkan fága ) - sámegiella lohkansuorgefágan - sámegiella válljenfágan
nob: - samisk som fremmedspråk ( B-språk for dem som har hatt undervisning i grunnskolen , C-språk for dem uten forkunnskaper )
